Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_azure_device_demo_app.c
/*******************************************************************************
 * File Name: mqtt_iot_azure_device_demo_app.c
 *
 * Description: This file contains tasks and functions related to Azure device
 * demo task.
 *
 *******************************************************************************
 * (c) 2024-2025, Infineon Technologies AG, or an affiliate of Infineon
 * Technologies AG. All rights reserved.
 * This software, associated documentation and materials ("Software") is
 * owned by Infineon Technologies AG or one of its affiliates ("Infineon")
 * and is protected by and subject to worldwide patent protection, worldwide
 * copyright laws, and international treaty provisions. Therefore, you may use
 * this Software only as provided in the license agreement accompanying the
 * software package from which you obtained this Software. If no license
 * agreement applies, then any use, reproduction, modification, translation, or
 * compilation of this Software is prohibited without the express written
 * permission of Infineon.
 *
 * Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
 * IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
 * INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
 * THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
 * SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
 * Infineon reserves the right to make changes to the Software without notice.
 * You are responsible for properly designing, programming, and testing the
 * functionality and safety of your intended application of the Software, as
 * well as complying with any legal requirements related to its use. Infineon
 * does not guarantee that the Software will be free from intrusion, data theft
 * or loss, or other breaches ("Security Breaches"), and Infineon shall have
 * no liability arising out of any Security Breaches. Unless otherwise
 * explicitly approved by Infineon, the Software may not be used in any
 * application where a failure of the Product or any consequences of the use
 * thereof can reasonably be expected to result in personal injury.
*******************************************************************************/

/* Header file includes */
#include "azure_common.h"

#include <stdio.h>
#include "cybsp.h"
#include "cy_log.h"
#include <lwip/tcpip.h>
#include <lwip/api.h>

#include <cybsp_wifi.h>
#include "cy_nw_helper.h"
#include "cyabs_rtos.h"

/* FreeRTOS header file */
#include <FreeRTOS.h>
#include <task.h>

#include "mqtt_main.h"
#include "cy_mqtt_api.h"
#include <az_core.h>
#include <az_iot.h>
#include "mqtt_iot_common.h"

/* IoT SDK, Secure Sockets, and MQTT initialization */
#include "cy_tcpip_port_secure_sockets.h"

/*******************************************************************************
* Macros
*******************************************************************************/
#define MAX_TELEMETRY_MESSAGE_COUNT                 (5U)
#define TELEMETRY_SEND_INTERVAL_SEC                 (1U * 1000U)
#define MAX_MESSAGE_COUNT                           (100U)

/* Wait duration between messages, should be in multiples of 5 */
#define MESSAGE_WAIT_LOOP_DURATION_SEC              (5U)

#define MESSAGE_WAIT_DELAY_MSEC                     (1000U * 5U)

#define SAS_KEY_DURATION_MINUTES                    (240U)

#define MQTT_CLIENT_ID_BUFFER_SIZE                  (128U)

#define TELEMETRY_TOPIC_BUFFER_SIZE                 (128U)

/* Defines for methods app */
#define METHODS_RESPONSE_TOPIC_BUFFER_SIZE          (128U)

#define GET_QUEUE_TIMEOUT_MSEC                      (500U)

#define PUT_QUEUE_TIMEOUT_MSEC                      (500U)

#define METHOD_WAIT_LOOP_DURATION_MSEC              (120U * 1000U)

/* Defines for twin app */
#define MAX_TWIN_MESSAGE_COUNT                      (5U)

#define MESSAGE_SEND_RECEIVE_INTERVAL_MSEC          (10U * 1000U)

#define GET_SEMAPHORE_TIMEOUT_MSEC                  (500U)

#define DEVICE_TWIN_WAIT_LOOP_DURATION_MSEC         (120U * 1000U)

#define DEVICE_TWIN_TIMEOUT_MSEC                    (500U)

#define TWIN_MESSAGE_WAIT_DELAY_MSEC                (1000U)

#define DEVICE_DEMO_APP_TIMEOUT_MSEC                (5U)

#define HUB_DIRECT_METHOD_EVENT_QUEUE_LENGTH        (10U)

#define C2D_FEATURE                                 (0U)
#define METHODS_FEATURE                             (1U)
#define DEVICE_TWIN_FEATURE_PATCH                   (2U)
#define DEVICE_TWIN_FEATURE_RESPONSE                (3U)

/***********************************************************
* Constants
************************************************************/
static az_span const method_ping_name = AZ_SPAN_LITERAL_FROM_STR("ping");
static az_span const method_ping_response = AZ_SPAN_LITERAL_FROM_STR("{\"response\": \"pong\"}");
static az_span const method_empty_response_payload = AZ_SPAN_LITERAL_FROM_STR("{}");
static az_span const twin_document_topic_request_id = AZ_SPAN_LITERAL_FROM_STR("get_twin");
static az_span const twin_patch_topic_request_id = AZ_SPAN_LITERAL_FROM_STR("reported_prop");
static az_span const version_name = AZ_SPAN_LITERAL_FROM_STR("$version");
static az_span const desired_device_count_property_name = AZ_SPAN_LITERAL_FROM_STR("Test_count");
static int32_t device_count_value = 0;

/************************************************************
* Static Variables
************************************************************/
static cy_mqtt_t                           mqtthandle;
static iot_sample_environment_variables    env_vars;
static az_iot_hub_client                   hub_client;
static char                                mqtt_client_username_buffer[IOT_SAMPLE_APP_BUFFER_SIZE_IN_BYTES];
static char                                mqtt_endpoint_buffer[IOT_SAMPLE_APP_BUFFER_SIZE_IN_BYTES];
static volatile bool                       connect_state = false;
static QueueHandle_t                       hub_direct_method_event_queue = NULL;
static cy_semaphore_t                      twin_app_sem = NULL;

#if SAS_TOKEN_AUTH
static iot_sample_credentials              sas_credentials;
static char                                device_id_buffer[IOT_SAMPLE_APP_BUFFER_SIZE_IN_BYTES];
static char                                sas_token_buffer[IOT_SAMPLE_APP_BUFFER_SIZE_IN_BYTES];
#endif

/* The network buffer must remain valid for the lifetime of the MQTT context. */
static uint8_t                             *buffer = NULL;

