Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_azure_device_demo_app.c
/*******************************************************************************
* Function Name: send_method_response
********************************************************************************
* Summary:
*  This function publishes methods response to Azure Hub.
*
* Parameters:
*  method_request: A method request received from IoT Hub.
*
*  status: Azure IoT service status codes.
*
*  az_span response: Represents a "view" over a byte buffer that represents a
*  contiguous region of memory. It contains a pointer to the start of the byte
*  buffer and the buffer's size.
*
* Return:
*  cy_rslt_t: Provides the result of an operation as a structured bitfield.
*
*******************************************************************************/
static cy_rslt_t send_method_response(az_iot_hub_client_method_request const* method_request,
        az_iot_status status, az_span response)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int rc;
    size_t topic_len;
    cy_mqtt_publish_info_t pub_msg;

    /* Get the methods response topic to publish the method response */
    char methods_response_topic_buffer[METHODS_RESPONSE_TOPIC_BUFFER_SIZE];

    memset( &methods_response_topic_buffer, 0x00, sizeof(methods_response_topic_buffer) );
    memset( &pub_msg, 0x00, sizeof( cy_mqtt_publish_info_t ) );

    rc = az_iot_hub_client_methods_response_get_publish_topic( &hub_client, method_request->request_id,
            (uint16_t)status, methods_response_topic_buffer,
            sizeof(methods_response_topic_buffer),
            (size_t *)&topic_len );
    if( az_result_failed(rc) )
    {
        TEST_INFO(( "\r\nFailed to get the Methods Response topic: az_result return code 0x%08x.", rc ));
        return ( (cy_rslt_t)TEST_FAIL );
    }

    pub_msg.qos = (cy_mqtt_qos_t)CY_MQTT_QOS0;
    pub_msg.topic = (const char *)&methods_response_topic_buffer;
    pub_msg.topic_len = topic_len;
    pub_msg.payload = (const char *)response._internal.ptr;
    pub_msg.payload_len = (size_t)response._internal.size;

    result = cy_mqtt_publish( mqtthandle, &pub_msg );
    if( TEST_PASS == result )
    {
        TEST_INFO(( "\r\ncy_mqtt_publish completed........\n\r" ));
    }
    else
    {
        TEST_INFO(( "\r\ncy_mqtt_publish failed with Error : [0x%X] ", (unsigned int)result ));
        return result;
    }
    TEST_INFO(( "\r\nClient published the Methods response.\r\n" ));
    TEST_INFO(( "\r\nStatus: %u\r\n", (uint16_t)status ));
    TEST_INFO(( "\r\nPayload: %.*s\r\n", (int)response._internal.size,  response._internal.ptr ));
    return result;
}

/******************************************************************************
 * Function Name: invoke_ping
 ******************************************************************************
 * Summary:
 *  Returns method response string.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  az_span: Represents a "view" over a byte buffer that represents a
 *  contiguous region of memory. It contains a pointer to the start of the byte
 *  buffer and the buffer's size.
 *
 ******************************************************************************/
static az_span invoke_ping(void)
{
    TEST_INFO(( "\r\nPING.......!\r\n" ));
    return method_ping_response;
}

/*******************************************************************************
 * Function Name: handle_method_request
 *******************************************************************************
 * Summary:
 *  Matches the method request name with required value - "ping" and handles
 *  the response accordingly.
 *
 * Parameters:
 *  method_request: A method request received from IoT Hub.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void handle_method_request(az_iot_hub_client_method_request const* method_request)
{
    if( az_span_is_content_equal( method_ping_name, method_request->name ) )
    {
        /* Invoke method */
        az_span response = invoke_ping();
        TEST_INFO(( "\r\nClient invoked method 'ping'.\r\n" ));
        send_method_response( method_request, AZ_IOT_STATUS_OK, response );
    }
    else
    {
        TEST_INFO(( "\r\nMethod not supported :  %.*s\r\n", (int)(method_request->name._internal.size), (method_request->name._internal.ptr) ));
        send_method_response( method_request, AZ_IOT_STATUS_NOT_FOUND, method_empty_response_payload );
    }
}

/*******************************************************************************
 * Function Name: parse_hub_method_message
 *******************************************************************************
 * Summary:
 *  Parses the message received over MQTT from the Azure IoT hub.
 *
 * Parameters:
 *  topic: Pointer to topic of received message.
 *
 *  topic_len: Length of topic of received message.
 *
 *  message: MQTT publish/receive information structure.
 *
 *  out_method_request: A method request received from IoT Hub.
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield.
 *
 ******************************************************************************/
static cy_rslt_t parse_hub_method_message(char* topic, int topic_len, cy_mqtt_publish_info_t *message,
        az_iot_hub_client_method_request* out_method_request)
{
    az_span const topic_span = az_span_create((uint8_t*)topic, topic_len);
    az_span const message_span = az_span_create((uint8_t*)message->payload, message->payload_len);

    /* Parse the message and retrieve the method_request info */
    az_result rc = az_iot_hub_client_methods_parse_received_topic( &hub_client, topic_span, out_method_request );
    if( az_result_failed(rc) )
    {
        TEST_INFO(( "\r\nMessage from unknown topic: az_result return code 0x%08x.", (unsigned int)rc ));
        TEST_INFO(( "\r\nTopic : %.*s\r\n", (int)topic_span._internal.size, topic_span._internal.ptr ));
        return ( (cy_rslt_t)TEST_FAIL );
    }
    TEST_INFO(( "\r\nClient received a valid topic response." ));
    TEST_INFO(( "\r\nTopic : %.*s\r\n", (int)topic_span._internal.size, topic_span._internal.ptr ));
    TEST_INFO(( "\r\nPayload: %.*s\r\n", (int)message_span._internal.size,  message_span._internal.ptr ));
    return CY_RSLT_SUCCESS;
}

