Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_azure_device_demo_app.c
/*******************************************************************************
 * Function Name: build_reported_property
 *******************************************************************************
 * Summary:
 *  This function builds the JSON format property to report back to Azure Hub.
 *  The reported property contains the updated value of "Test_count".
 *
 * Parameters:
 *  reported_property_payload: Structure to hold reported property
 *  payload buffer.
 *
 *  out_reported_property_payload: Pointer to JSON text written to the
 *  underlying buffer so far, in the last provided destination buffer.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void build_reported_property(
        az_span reported_property_payload,
        az_span* out_reported_property_payload)
{
    char const* const log = "Failed to build reported property payload";

    az_json_writer jw;
    IOT_SAMPLE_EXIT_IF_AZ_FAILED(az_json_writer_init(&jw, reported_property_payload, NULL), log);
    IOT_SAMPLE_EXIT_IF_AZ_FAILED(az_json_writer_append_begin_object(&jw), log);
    IOT_SAMPLE_EXIT_IF_AZ_FAILED(
            az_json_writer_append_property_name(&jw, desired_device_count_property_name), log);
    IOT_SAMPLE_EXIT_IF_AZ_FAILED(az_json_writer_append_int32(&jw, device_count_value), log);
    IOT_SAMPLE_EXIT_IF_AZ_FAILED(az_json_writer_append_end_object(&jw), log);

    *out_reported_property_payload = az_json_writer_get_bytes_used_in_destination(&jw);
}

/*******************************************************************************
 * Function Name: send_reported_property
 *******************************************************************************
 * Summary:
 *  Function to create and send the JSON format of the property that is to be
 *  reported.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void send_reported_property(void)
{
    int rc;
    uint16_t topic_len = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_mqtt_publish_info_t pub_msg;
    char reported_property_payload_buffer[128];
    char twin_patch_topic_buffer[128];

    memset( &pub_msg, 0x00, sizeof( cy_mqtt_publish_info_t ) );
    memset( &reported_property_payload_buffer, 0x00, sizeof( reported_property_payload_buffer ) );
    memset( &twin_patch_topic_buffer, 0x00, sizeof( twin_patch_topic_buffer ) );

    IOT_SAMPLE_LOG("\n\rClient sending reported property to service.");

    /* Get the Twin Patch topic to publish a reported property update */
    rc = az_iot_hub_client_twin_patch_get_publish_topic(
            &hub_client,
            twin_patch_topic_request_id,
            twin_patch_topic_buffer,
            sizeof(twin_patch_topic_buffer),
            (size_t*)&topic_len);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("\n\rFailed to get the Twin Patch topic: az_result return code 0x%08x.", rc);
        return;
    }

    az_span reported_property_payload = AZ_SPAN_FROM_BUFFER(reported_property_payload_buffer);
    build_reported_property( reported_property_payload, &reported_property_payload );

    pub_msg.qos = (cy_mqtt_qos_t)CY_MQTT_QOS0;
    pub_msg.topic = (const char *)&twin_patch_topic_buffer;
    pub_msg.topic_len = topic_len;
    pub_msg.payload = (const char *)reported_property_payload._internal.ptr;
    pub_msg.payload_len = (size_t)reported_property_payload._internal.size;

    /* Publish the reported property update */
    result = cy_mqtt_publish( mqtthandle, &pub_msg );
    if( TEST_PASS == result )
    {
        TEST_INFO(( "\r\ncy_mqtt_publish completed........\n\r" ));
    }
    else
    {
        TEST_INFO(( "\r\ncy_mqtt_publish failed with Error : [0x%X] ", (unsigned int)result ));
        return;
    }

    TEST_INFO(( "\r\nClient published the Twin Patch reported property message." ));
    TEST_INFO(( "\r\nPayload: %.*s\r\n", (int)reported_property_payload._internal.size, reported_property_payload._internal.ptr ));
}

/*******************************************************************************
 * Function Name: update_device_count_property
 *******************************************************************************
 * Summary:
 *  Function to update the "Test_count" received from the Azure Hub to the
 *  device_count variable.
 *
 * Parameters:
 *  device_count: Global variable to hold "Test_count" value.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void update_device_count_property(int32_t device_count)
{
    device_count_value = device_count;
    TEST_INFO(( "Client updated `%.*s` locally to %d.\n",
            (int)az_span_size(desired_device_count_property_name),
            az_span_ptr(desired_device_count_property_name),
            (int)device_count_value ));
}

/*******************************************************************************
 * Function Name: parse_desired_device_count_property
 *******************************************************************************
 * Summary:
 *  Parse the message received from Azure Hub to retrieve desired "Test_count"
 *  property.
 *
 * Parameters:
 *  message_span: Structure to hold the received message.
 *
 *  out_parsed_device_count: Used to store the received value of
 *  "Test_count".
 *
 * Return:
 *  bool
 *
 ******************************************************************************/
static bool parse_desired_device_count_property(az_span message_span,
        int32_t* out_parsed_device_count)
{
    char const* const log = "Failed to parse for desired `%.*s` property";
    az_span property = desired_device_count_property_name;

    bool property_found = false;
    *out_parsed_device_count = 0;

    /* Parse message_span */
    az_json_reader jr;
    IOT_SAMPLE_EXIT_IF_AZ_FAILED( az_json_reader_init(&jr, message_span, NULL), log, property );
    IOT_SAMPLE_EXIT_IF_AZ_FAILED( az_json_reader_next_token(&jr), log, property );
    if( jr.token.kind != AZ_JSON_TOKEN_BEGIN_OBJECT )
    {
        TEST_INFO(( "\r\n`%.*s` property was not found in desired property response.",
                (int)az_span_size(property),
                az_span_ptr(property) ));
        return false;
    }

