Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_azure_device_demo_app.c
    IOT_SAMPLE_EXIT_IF_AZ_FAILED(az_json_reader_next_token(&jr), log, property);
    while (!property_found && (jr.token.kind != AZ_JSON_TOKEN_END_OBJECT))
    {
        if( az_json_token_is_text_equal(&jr.token, desired_device_count_property_name) )
        {
            /* Move to the value token */
            IOT_SAMPLE_EXIT_IF_AZ_FAILED( az_json_reader_next_token(&jr), log, property );
            IOT_SAMPLE_EXIT_IF_AZ_FAILED( az_json_token_get_int32(&jr.token, out_parsed_device_count), log, property);
            property_found = true;
        }
        else if( az_json_token_is_text_equal(&jr.token, version_name) )
        {
            break;
        }
        else
        {
            IOT_SAMPLE_EXIT_IF_AZ_FAILED(az_json_reader_skip_children(&jr), log, property);
        }
        IOT_SAMPLE_EXIT_IF_AZ_FAILED(az_json_reader_next_token(&jr), log, property);
    }

    if( property_found )
    {
        IOT_SAMPLE_LOG( "Parsed desired `%.*s`: %d",
                (int)az_span_size(property),
                az_span_ptr(property),
                (int)*out_parsed_device_count );
    }
    else
    {
        IOT_SAMPLE_LOG( "`%.*s` property was not found in desired property response.",
                (int)az_span_size(property),
                az_span_ptr(property) );
        return false;
    }

    return true;
}

/*******************************************************************************
 * Function Name: handle_device_twin_message
 *******************************************************************************
 * Summary:
 *  Handle for Device Twin type message.
 *
 * Parameters:
 *  message: MQTT publish information structure.
 *
 *  twin_response: Structure for Twin response.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void handle_device_twin_message(cy_mqtt_publish_info_t *message,
        az_iot_hub_client_twin_response const* twin_response)
{
    az_span const message_span = az_span_create((uint8_t*)message->payload, message->payload_len);
    cy_rslt_t result = CY_RSLT_SUCCESS;

    /* Invoke the appropriate action per response type (3 types only) */
    switch( twin_response->response_type )
    {
    case AZ_IOT_HUB_CLIENT_TWIN_RESPONSE_TYPE_GET:
        IOT_SAMPLE_LOG("Message Type: GET");
        break;

    case AZ_IOT_HUB_CLIENT_TWIN_RESPONSE_TYPE_REPORTED_PROPERTIES:
        IOT_SAMPLE_LOG("Message Type: Reported Properties");
        break;

    case AZ_IOT_HUB_CLIENT_TWIN_RESPONSE_TYPE_DESIRED_PROPERTIES:
        IOT_SAMPLE_LOG("Message Type: Desired Properties");

        /* Parse for the device count property */
        int32_t desired_device_count = 0;
        if( parse_desired_device_count_property( message_span, &desired_device_count ) )
        {
            IOT_SAMPLE_LOG(" "); /* Formatting */
            /* Update the device count locally and report the update to
             * the server
             */
            update_device_count_property( desired_device_count );

            result = xSemaphoreGive( twin_app_sem );
            if( result != pdTRUE )
            {
                TEST_INFO(( "Releasing twin_app_sem failed with Error : [0x%X]\n", (unsigned int)result ));
            }

        }
        break;
    }
}

/*******************************************************************************
 * Function Name: parse_device_twin_message
 *******************************************************************************
 * Summary:
 *  Parse the message and retrieve twin_response info.
 *
 * Parameters:
 *  topic: Pointer to topic of received message.
 *
 *  topic_len: Length of topic of received message.
 *
 *  message: MQTT publish/subscribe information structure.
 *
 *  out_twin_response: Device twin response.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void parse_device_twin_message(char* topic, int topic_len,
        cy_mqtt_publish_info_t *message,
        az_iot_hub_client_twin_response* out_twin_response)
{
    az_span const topic_span = az_span_create( (uint8_t*)topic, topic_len);
    az_span const message_span = az_span_create( (uint8_t*)message->payload, message->payload_len );

    /* Parse the message and retrieve twin_response info */
    az_result rc = az_iot_hub_client_twin_parse_received_topic( &hub_client, topic_span, out_twin_response );
    if( az_result_failed(rc) )
    {
        IOT_SAMPLE_LOG_ERROR( "Message from unknown topic: az_result return code 0x%08x.", (unsigned int)rc );
        IOT_SAMPLE_LOG_AZ_SPAN( "Topic:", topic_span );
        return;
    }
    IOT_SAMPLE_LOG_SUCCESS( "Client received a valid topic response." );
    IOT_SAMPLE_LOG_AZ_SPAN( "Topic:", topic_span );
    IOT_SAMPLE_LOG_AZ_SPAN( "Payload:", message_span );
    IOT_SAMPLE_LOG( "Status: %d", out_twin_response->status );
}

/*******************************************************************************
 * Function Name: get_device_twin_document
 *******************************************************************************
 * Summary:
 *  Function to receive device twin document from Azure IoT hub.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void get_device_twin_document(void)
{
    int rc;
    uint16_t topic_len = 0;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_mqtt_publish_info_t pub_msg;
    char twin_document_topic_buffer[128];

    memset( &pub_msg, 0x00, sizeof( cy_mqtt_publish_info_t ) );
    memset( &twin_document_topic_buffer, 0x00, sizeof( twin_document_topic_buffer ) );
    IOT_SAMPLE_LOG("Client requesting device twin document from service.");

    rc = az_iot_hub_client_twin_document_get_publish_topic(
            &hub_client,
            twin_document_topic_request_id,
            twin_document_topic_buffer,
            sizeof(twin_document_topic_buffer),
            (size_t *)&topic_len);
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR(
                "Failed to get the Twin Document topic: az_result return code 0x%08x.", rc);
        exit(rc);
    }

