Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_azure_device_demo_app.c
    pub_msg.qos = (cy_mqtt_qos_t)CY_MQTT_QOS0;
    pub_msg.topic = (const char *)&twin_document_topic_buffer;
    pub_msg.topic_len = topic_len;
    pub_msg.payload = (const char *)NULL;
    pub_msg.payload_len = (size_t)0;

    /* Publish the twin document request */
    result = cy_mqtt_publish( mqtthandle, &pub_msg );
    if( TEST_PASS == result )
    {
        TEST_INFO(( "\r\ncy_mqtt_publish completed........\n\r" ));
    }
    else
    {
        TEST_INFO(( "\r\ncy_mqtt_publish failed with Error : [0x%X] ", (unsigned int)result ));
        return;
    }
}

/*******************************************************************************
 * Function Name: send_and_receive_device_twin_messages
 *******************************************************************************
 * Summary:
 *  Function to send/receive device twin property between Azure Hub and device.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield.
 *
 ******************************************************************************/
static cy_rslt_t send_and_receive_device_twin_messages(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    get_device_twin_document();

    vTaskDelay(pdMS_TO_TICKS(MESSAGE_SEND_RECEIVE_INTERVAL_MSEC));

    IOT_SAMPLE_LOG(" ");

    send_reported_property();

    IOT_SAMPLE_LOG_SUCCESS("Client received messages.");
    return result;
}

/*******************************************************************************
 * Function Name: parse_c2d_message
 *******************************************************************************
 * Summary:
 *  Parse the message and retrieve the c2d_request information.
 *
 * Parameters:
 *  topic: Topic of received MQTT message.
 *
 *  topic_len: Length of received message topic.
 *
 *  message: MQTT publish/subscribe information structure.
 *
 *  out_c2d_request: The Cloud-To-Device Request.
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void parse_c2d_message(char* topic, uint16_t topic_len,  cy_mqtt_publish_info_t *message,
        az_iot_hub_client_c2d_request* out_c2d_request)
{
    az_span const topic_span = az_span_create( (uint8_t*)topic, topic_len );
    az_span const message_span = az_span_create( (uint8_t*)message->payload, message->payload_len );

    /* Parse the message and retrieve the c2d_request information */
    az_result rc = az_iot_hub_client_c2d_parse_received_topic( &hub_client, topic_span, out_c2d_request );
    if( az_result_failed(rc) )
    {
        TEST_INFO(( "\r\nMessage from unknown topic: az_result return code 0x%08x.", (unsigned int)rc ));
        TEST_INFO(( "\r\nTopic : %.*s\r\n", (int)topic_span._internal.size, topic_span._internal.ptr ));
        return;
    }

    TEST_INFO(( "\r\nClient received a valid topic response." ));
    TEST_INFO(( "\r\nTopic : %.*s\r\n", (int)topic_span._internal.size, topic_span._internal.ptr ));
    TEST_INFO(( "\r\nPayload: %.*s\r\n", (int)message_span._internal.size,  message_span._internal.ptr ));
}

/*******************************************************************************
 * Function Name: mqtt_event_cb
 *******************************************************************************
 * Summary:
 *  Callback for MQTT type events.
 *
 * Parameters:
 *  mqtt_handle: Handle to MQTT instance.
 *
 *  event: MQTT event information structure.
 *
 *  arg
 *
 * Return:
 *  void
 *
 ******************************************************************************/
static void mqtt_event_cb(cy_mqtt_t mqtt_handle, cy_mqtt_event_t event, void *arg)
{
    cy_mqtt_publish_info_t *received_msg;
    az_iot_hub_client_c2d_request c2d_request;

    TEST_INFO(( "MQTT App callback with handle : %p \n", mqtt_handle ));

    switch( event.type )
    {
    case CY_MQTT_EVENT_TYPE_DISCONNECT :
        if( event.data.reason == CY_MQTT_DISCONN_TYPE_BROKER_DOWN )
        {
            TEST_INFO(( "CY_MQTT_DISCONN_TYPE_BROKER_DOWN .....\n" ));
        }
        else
        {
            TEST_INFO(( "CY_MQTT_DISCONN_REASON_NETWORK_DISCONNECTION .....\n" ));
        }
        connect_state = false;
        break;

    case CY_MQTT_EVENT_TYPE_PUBLISH_RECEIVE :
        received_msg = &(event.data.pub_msg.received_message);

        /* Case for C2D message */
        if( strstr((char*)received_msg->topic, "/messages/devicebound/") != NULL)
        {
            printf("\r\n##############\r\n Incoming C2D \r\n##############\n");
            parse_c2d_message( (char*)received_msg->topic, received_msg->topic_len, received_msg , &c2d_request );
            TEST_INFO(( "\r\nClient parsed C2D message." ));
        }

        /* Case for Methods message */
        else if(strstr((char*)received_msg->topic, "$iothub/methods/POST/") != NULL)
        {
            printf("\r\n##############\r\n Incoming Methods \r\n##############\n");
            /* Parse the method message and invoke the method */
            az_iot_hub_client_method_request method_request;
            parse_hub_method_message( (char*)received_msg->topic, received_msg->topic_len, received_msg, &method_request );
            TEST_INFO(( "Client parsed method request." ));
            TEST_INFO(( "Pushing to direct method queue...." ));

            if( xQueueSend( hub_direct_method_event_queue, (void *)&method_request, pdMS_TO_TICKS(PUT_QUEUE_TIMEOUT_MSEC) ) != pdPASS )
            {
                TEST_INFO(( "Pushing to hub_direct_method_event_queue failed\n"));
            }
        }

        /* Case for Device Twin message */
        else if(strstr((char*)received_msg->topic, "$iothub/twin/") != NULL )
        {
            printf("\r\n##############\r\n Incoming Device Twin \r\n##############\n");
            received_msg = &(event.data.pub_msg.received_message);
            /* Parse the device twin message */
            az_iot_hub_client_twin_response twin_response;
            parse_device_twin_message( (char*)received_msg->topic, received_msg->topic_len, received_msg, &twin_response);
            TEST_INFO(( "Client parsed device twin message." ));
            handle_device_twin_message( received_msg, &twin_response);
        }

        break;

    default :
        TEST_INFO(( "Unknown Event .....\n" ));
        break;
    }
}

