Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_azure_device_demo_app.c
/*******************************************************************************
 * Function Name: disconnect_and_delete_mqtt_client
 *******************************************************************************
 * Summary:
 *  Function to disconnect and delete MQTT client.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield
 *
 ******************************************************************************/
static cy_rslt_t disconnect_and_delete_mqtt_client(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    result = cy_mqtt_disconnect( mqtthandle );
    if( CY_RSLT_SUCCESS == result)
    {
        TEST_INFO(( "cy_mqtt_disconnect ----------------------- Pass \n" ));
    }
    else
    {
        TEST_INFO(( "cy_mqtt_disconnect ----------------------- Fail \n" ));
    }
    connect_state = false;

    result = cy_mqtt_delete( mqtthandle );
    if( TEST_PASS == result )
    {
        TEST_INFO(( "cy_mqtt_delete --------------------------- Pass \n" ));
    }
    else
    {
        TEST_INFO(( "cy_mqtt_delete --------------------------- Fail \n" ));
    }

    result = cy_mqtt_deinit();
    if( TEST_PASS == result )
    {
        TEST_INFO(( "cy_mqtt_deinit --------------------------- Pass \n" ));
    }
    else
    {
        TEST_INFO(( "cy_mqtt_deinit --------------------------- Fail \n" ));
    }

    /* Free the network buffer */
    if( buffer != NULL )
    {
        free( buffer );
        buffer = NULL;
    }

    return result;
}

/*******************************************************************************
 * Function Name: send_telemetry_messages_to_iot_hub
 *******************************************************************************
 * Summary:
 *  Function to send device telemetry messages to Azure Hub.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield.
 *
 ******************************************************************************/
static cy_rslt_t send_telemetry_messages_to_iot_hub(void)
{
    int rc;
    cy_rslt_t result = CY_RSLT_SUCCESS;
    size_t topic_len = 0;
    cy_mqtt_publish_info_t pub_msg;
    uint8_t offset = 0;

    /* Get the Telemetry topic to publish telemetry messages. */
    char telemetry_topic_buffer[TELEMETRY_TOPIC_BUFFER_SIZE];

    memset( &telemetry_topic_buffer, 0x00, sizeof( telemetry_topic_buffer ) );
    memset( &pub_msg, 0x00, sizeof( cy_mqtt_publish_info_t ) );

    rc = az_iot_hub_client_telemetry_get_publish_topic( &hub_client, NULL, telemetry_topic_buffer,
            sizeof(telemetry_topic_buffer), &topic_len );
    if (az_result_failed(rc))
    {
        IOT_SAMPLE_LOG_ERROR("Failed to get the Telemetry topic: az_result return code 0x%08x.", rc);
        return TEST_FAIL;
    }

    char const* telemetry_message_payloads[MAX_TELEMETRY_MESSAGE_COUNT] = {
            "{\"message_number\":1}", "{\"message_number\":2}", "{\"message_number\":3}",
            "{\"message_number\":4}", "{\"message_number\":5}",
    };

    /* Publish the number of telemetry messages. */
    for( uint8_t message_count = 0; message_count < MAX_MESSAGE_COUNT; message_count++ )
    {
        offset = ( message_count % MAX_TELEMETRY_MESSAGE_COUNT);
        pub_msg.qos = (cy_mqtt_qos_t)CY_MQTT_QOS0;
        pub_msg.topic = (const char *)&telemetry_topic_buffer;
        pub_msg.topic_len = topic_len;
        pub_msg.payload = (const char *)telemetry_message_payloads[offset];
        pub_msg.payload_len = (size_t)( strlen(telemetry_message_payloads[offset]) );

        /* Publish the reported property update. */
        result = cy_mqtt_publish( mqtthandle, &pub_msg );
        if( TEST_PASS == result )
        {
            TEST_INFO(( "cy_mqtt_publish completed........\n\r" ));
            IOT_SAMPLE_LOG_SUCCESS( "Message #%d: Client published the Telemetry message.", message_count + 1);
            IOT_SAMPLE_LOG( "Payload: %s\n", telemetry_message_payloads[offset] );
        }
        else
        {
            TEST_INFO(( "cy_mqtt_publish failed with Error : [0x%X] ", (unsigned int)result ));
            return TEST_FAIL;
        }
        vTaskDelay(pdMS_TO_TICKS(TELEMETRY_SEND_INTERVAL_SEC));
    }
    return CY_RSLT_SUCCESS;
}

/*******************************************************************************
 * Function Name: subscribe_azure_hub_features_topics
 *******************************************************************************
 * Summary:
 *  Function to Simultaneously subscribe to corresponding topics of Azure IoT
 *  Hub features.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield.
 *
 ******************************************************************************/
static cy_rslt_t subscribe_azure_hub_features_topics(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    cy_mqtt_subscribe_info_t sub_msg[4];

    /* Subscription topic and parameters for C2D feature. */
    sub_msg[C2D_FEATURE].qos = (cy_mqtt_qos_t)CY_MQTT_QOS1;
    sub_msg[C2D_FEATURE].topic = AZ_IOT_HUB_CLIENT_C2D_SUBSCRIBE_TOPIC;
    sub_msg[C2D_FEATURE].topic_len = ( ( uint16_t ) ( sizeof( AZ_IOT_HUB_CLIENT_C2D_SUBSCRIBE_TOPIC ) - 1 ) );

    /* Subscription topic and parameters for Methods feature. */
    sub_msg[METHODS_FEATURE].qos = (cy_mqtt_qos_t)CY_MQTT_QOS1;
    sub_msg[METHODS_FEATURE].topic = AZ_IOT_HUB_CLIENT_METHODS_SUBSCRIBE_TOPIC;
    sub_msg[METHODS_FEATURE].topic_len = ( ( uint16_t ) ( sizeof( AZ_IOT_HUB_CLIENT_METHODS_SUBSCRIBE_TOPIC ) - 1 ) );

    /* Subscription topic and parameters for Device Twin Patch,
     * for retrieving desired twin property. */
    sub_msg[DEVICE_TWIN_FEATURE_PATCH].qos = (cy_mqtt_qos_t)CY_MQTT_QOS1;
    sub_msg[DEVICE_TWIN_FEATURE_PATCH].topic = AZ_IOT_HUB_CLIENT_TWIN_PATCH_SUBSCRIBE_TOPIC;
    sub_msg[DEVICE_TWIN_FEATURE_PATCH].topic_len = sizeof( AZ_IOT_HUB_CLIENT_TWIN_PATCH_SUBSCRIBE_TOPIC ) -1 ;

    /* Subscription topic and parameters for Device Twin Response for device twin response. */
    sub_msg[DEVICE_TWIN_FEATURE_RESPONSE].qos = (cy_mqtt_qos_t)CY_MQTT_QOS1;
    sub_msg[DEVICE_TWIN_FEATURE_RESPONSE].topic = AZ_IOT_HUB_CLIENT_TWIN_RESPONSE_SUBSCRIBE_TOPIC;
    sub_msg[DEVICE_TWIN_FEATURE_RESPONSE].topic_len = sizeof( AZ_IOT_HUB_CLIENT_TWIN_RESPONSE_SUBSCRIBE_TOPIC ) -1 ;

    /* Simultaneously Subscribe to topics of Azure features
     * stored in sub_msg array. */
    result = cy_mqtt_subscribe( mqtthandle, sub_msg, 4 );
    if( TEST_PASS == result )
    {
        TEST_INFO(( "cy_mqtt_subscribe for combo "
                "------------------------ Pass \n" ));
    }
    else
    {
        TEST_INFO(( "cy_mqtt_subscribe for combo "
                "------------------------ Fail \n" ));
    }

    return result;
}

