Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_azure_device_demo_app.c
/*******************************************************************************
 * Function Name: configure_hub_environment_variables
 *******************************************************************************
 * Summary:
 *  Configure MQTT hub environment variables like device ID and hostname
 *  endpoint.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Provides the result of an operation as a structured bitfield.
 *
 ******************************************************************************/
static cy_rslt_t configure_hub_environment_variables(void)
{
    cy_rslt_t result = TEST_PASS;
#if SAS_TOKEN_AUTH
    env_vars.hub_device_id._internal.ptr = (uint8_t*) sas_credentials.device_id;
    env_vars.hub_device_id._internal.size = (int32_t) sas_credentials.device_id_len;
    env_vars.hub_sas_key._internal.ptr = (uint8_t*) sas_credentials.sas_token;
    env_vars.hub_sas_key._internal.size = (int32_t) sas_credentials.sas_token_len;
#else
    env_vars.hub_device_id._internal.ptr = (uint8_t*) MQTT_CLIENT_IDENTIFIER_AZURE_CERT;
    env_vars.hub_device_id._internal.size = MQTT_CLIENT_IDENTIFIER_AZURE_CERT_LENGTH;
    env_vars.hub_sas_key._internal.ptr = NULL;
    env_vars.hub_sas_key._internal.size = 0;
#endif
    env_vars.hub_hostname._internal.ptr = (uint8_t*) IOT_DEMO_SERVER_AZURE;
    env_vars.hub_hostname._internal.size = strlen(IOT_DEMO_SERVER_AZURE);
    env_vars.sas_key_duration_minutes = SAS_KEY_DURATION_MINUTES;
    return result;
}

/*******************************************************************************
 * Function Name: method_feature_task
 *******************************************************************************
 * Summary:
 *  Task to run Azure IoT hub method feature. Handles method request and it's
 *  response.
 *
 * Parameters:
 *  arg
 *
 * Return:
 *  void
 *
 ******************************************************************************/
void method_feature_task(void *arg)
{
    uint32_t time_ms = 0;
    az_iot_hub_client_method_request method_request;

    /*
     * Initialize the queue for hub method events
     */
    hub_direct_method_event_queue = xQueueCreate( HUB_DIRECT_METHOD_EVENT_QUEUE_LENGTH, sizeof(az_iot_hub_client_method_request) );
    if(hub_direct_method_event_queue != NULL)
    {
        TEST_INFO(( "hub_direct_method_event_queue create for methods feature ----------- Pass\n" ));
    }

    else
    {
        TEST_INFO(( "hub_direct_method_event_queue create for methods feature ----------- Fail\n" ));
    }

    time_ms = ( METHOD_WAIT_LOOP_DURATION_MSEC );
    while( connect_state && (time_ms > 0) )
    {
        if(xQueueReceive(hub_direct_method_event_queue, (void *)&method_request, pdMS_TO_TICKS(GET_QUEUE_TIMEOUT_MSEC) ) == pdPASS)
        {
            handle_method_request( &method_request );
            TEST_INFO(( " " ));
            TEST_INFO(( "Client received messages.\r\n" ));
        }

        time_ms = time_ms - GET_QUEUE_TIMEOUT_MSEC;
    }

    vTaskSuspend(NULL);
}

/*******************************************************************************
 * Function Name: device_twin_feature_task
 *******************************************************************************
 * Summary:
 *  Task to run Azure IoT hub device twin feature. Handles device twin property
 *  related message transfers between device and cloud.
 *
 * Parameters:
 *  arg
 *
 * Return:
 *  void
 *
 ******************************************************************************/
void device_twin_feature_task(void *arg)
{
    cy_rslt_t TestRes = TEST_PASS ;
    uint32_t time_ms = 0;

    TestRes = send_and_receive_device_twin_messages();
    if( TEST_PASS == TestRes )
    {
        TEST_INFO(( "send_and_receive_device_twin_messages ----------- Pass\n" ));
    }
    else
    {
        TEST_INFO(( "send_and_receive_device_twin_messages ----------- Fail\n" ));
        goto exit_device_twin;
    }

    time_ms = ( DEVICE_TWIN_WAIT_LOOP_DURATION_MSEC );
    while( connect_state && (time_ms > 0))
    {

        TestRes = xSemaphoreTake( twin_app_sem, portMAX_DELAY );
        if( TestRes == pdTRUE )
        {
            send_reported_property();
            TEST_INFO(( " " ));
            TEST_INFO(( "Client received messages." ));
        }

        time_ms = time_ms - DEVICE_TWIN_TIMEOUT_MSEC;
        vTaskDelay(pdMS_TO_TICKS(TWIN_MESSAGE_WAIT_DELAY_MSEC));
    }

    exit_device_twin:
    vTaskSuspend(NULL);
}

/*******************************************************************************
 * Function Name: Azure_Device_Demo_app
 *******************************************************************************
 * Summary:
 *  Task to establish connection to Azure IoT hub and create it's feature tasks.
 *
 * Parameters:
 *  arg
 *
 * Return:
 *  void
 *
 ******************************************************************************/
void Azure_Device_Demo_app(void *arg)
{
    cy_rslt_t TestRes = TEST_PASS ;
    uint8_t Failcount = 0, Passcount = 0, time_sec = 0;

#ifdef CY_TFM_PSA_SUPPORTED
    psa_status_t uxStatus = PSA_SUCCESS;
    size_t read_len = 0;
    (void)uxStatus;
    (void)read_len;
#endif

    /* Initialize the semaphore for hub methods events */
    twin_app_sem = xSemaphoreCreateCounting( 1, 0 );
    if( twin_app_sem != NULL )
    {
        TEST_INFO(( "xSemaphoreCreateCounting for Twin App ----------- Pass\n" ));
    }
    else
    {
        TEST_INFO(( "xSemaphoreCreateCounting for Twin App ----------- Fail\n" ));
        goto exit;
    }

#if SAS_TOKEN_AUTH
    (void)device_id_buffer;
    (void)sas_token_buffer;
#if ( (defined CY_TFM_PSA_SUPPORTED) && ( SAS_TOKEN_LOCATION_FLASH == false ) )
    /* Read the Device ID from the secured memory */
    uxStatus = psa_ps_get( PSA_DEVICEID_UID, 0, sizeof(device_id_buffer), device_id_buffer, &read_len );
    if( uxStatus == PSA_SUCCESS )
    {
        device_id_buffer[read_len] = '\0';
        TEST_INFO(( "Retrieved Device ID : %s\r\n", device_id_buffer ));
        sas_credentials.device_id = (uint8_t*)device_id_buffer;
        sas_credentials.device_id_len = read_len;
    }
    else
    {
        TEST_INFO(( "psa_ps_get for Device ID failed with %d\n", (int)uxStatus ));
        TEST_INFO(( "Taken Device ID from MQTT_CLIENT_IDENTIFIER_AZURE_SAS macro. \n" ));
        sas_credentials.device_id = (uint8_t*)MQTT_CLIENT_IDENTIFIER_AZURE_SAS;
        sas_credentials.device_id_len = MQTT_CLIENT_IDENTIFIER_AZURE_SAS_LENGTH;
    }

    read_len = 0;

    /* Read the SAS token from the secured memory */
    uxStatus = psa_ps_get( PSA_SAS_TOKEN_UID, 0, sizeof(sas_token_buffer), sas_token_buffer, &read_len );
    if( uxStatus == PSA_SUCCESS )
    {
        sas_token_buffer[read_len] = '\0';
        TEST_INFO(( "Retrieved SAS token : %s\r\n", sas_token_buffer ));
        sas_credentials.sas_token = (uint8_t*)sas_token_buffer;
        sas_credentials.sas_token_len = read_len;
    }
    else
    {
        TEST_INFO(( "psa_ps_get for sas_token failed with %d\n", (int)uxStatus ));
        TEST_INFO(( "Taken SAS Token from IOT_AZURE_PASSWORD macro. \n" ));
        sas_credentials.sas_token = (uint8_t *)IOT_AZURE_PASSWORD;
        sas_credentials.sas_token_len = IOT_AZURE_PASSWORD_LENGTH;
    }
#else
    sas_credentials.device_id = (uint8_t*) MQTT_CLIENT_IDENTIFIER_AZURE_SAS;
    sas_credentials.device_id_len = MQTT_CLIENT_IDENTIFIER_AZURE_SAS_LENGTH;
    sas_credentials.sas_token = (uint8_t*) IOT_AZURE_PASSWORD;
    sas_credentials.sas_token_len = IOT_AZURE_PASSWORD_LENGTH;
#endif

