Infineon/mtb-example-psoc-edge-azure-iot/proj_cm33_ns/mqtt_iot_azure_device_demo_app.c
#endif /* SAS_TOKEN_AUTH */

    TestRes = configure_hub_environment_variables();
    if( TEST_PASS == TestRes )
    {
        TEST_INFO(( "configure_environment_variables ----------- Pass\n" ));
        Passcount++;
    }
    else
    {
        TEST_INFO(( "configure_environment_variables ----------- Fail\n" ));
        Failcount++;
        goto exit;
    }

    TestRes = create_and_configure_mqtt_client();
    if( TEST_PASS == TestRes )
    {
        TEST_INFO(( "create_and_configure_mqtt_client ----------- Pass\n" ));
        Passcount++;
    }
    else
    {
        TEST_INFO(( "create_and_configure_mqtt_client ----------- Fail\n" ));
        Failcount++;
        goto exit;
    }

    TestRes = connect_mqtt_client_to_iot_hub();
    if( TEST_PASS == TestRes )
    {
        TEST_INFO(( "connect_mqtt_client_to_iot_hub ----------- Pass\n" ));
        Passcount++;
    }
    else
    {
        TEST_INFO(( "connect_mqtt_client_to_iot_hub ----------- Fail\n" ));
        Failcount++;
        goto exit;
    }

    TestRes = subscribe_azure_hub_features_topics();
    if( TEST_PASS == TestRes )
    {
        TEST_INFO(( "subscribe_mqtt_client_to_iot_hub_topics for Telemetry "
                "----------- Pass\n" ));
        Passcount++;
    }
    else
    {
        TEST_INFO(( "subscribe_mqtt_client_to_iot_hub_topics for TELEMTRY "
                "----------- Fail\n" ));
        Failcount++;
    }

    /* Method feature task creation */
    xTaskCreate(method_feature_task, "method_feature_task",
            AZURE_TASK_STACK_METHODS, NULL, AZURE_TASK_PRIORITY_METHODS, NULL);

    /* Twin feature task creation */
    xTaskCreate(device_twin_feature_task, "device_twin_feature_task",
            AZURE_TASK_STACK_TWIN, NULL, AZURE_TASK_PRIORITY_TWIN, NULL);

    TestRes = send_telemetry_messages_to_iot_hub();
    if( TEST_PASS == TestRes )
    {
        TEST_INFO(( "send_telemetry_messages_to_iot_hub ----------- Pass\n" ));
        Passcount++;
    }
    else
    {
        TEST_INFO(( "send_telemetry_messages_to_iot_hub ----------- Fail\n" ));
        Failcount++;
    }

    /* Delay Loop for Azure Device Demo app task */
    time_sec = MESSAGE_WAIT_LOOP_DURATION_SEC;
    while( (connect_state) && (time_sec > 0) )
    {
        vTaskDelay(pdMS_TO_TICKS(MESSAGE_WAIT_DELAY_MSEC));
        time_sec = time_sec - DEVICE_DEMO_APP_TIMEOUT_MSEC;
    }

    exit:

    printf("################################\n"
            "Azure Device App demo Ends\n"
            "################################\n");

    TEST_INFO(( "Disconnecting from broker...... \n" ));
    TestRes = disconnect_and_delete_mqtt_client();
    if( TEST_PASS == TestRes )
    {
        TEST_INFO(( "disconnect_and_delete_mqtt_client ----------- Pass\n" ));
        Passcount++;
    }
    else
    {
        TEST_INFO(( "disconnect_and_delete_mqtt_client ----------- Fail\n" ));
        Failcount++;
        goto exit;
    }

    TEST_INFO(( "Completed MQTT Client Test Cases --------------------------\n" ));
    TEST_INFO(( "Total Test Cases   ---------------------- %d\n", ( Failcount + Passcount ) ));
    TEST_INFO(( "Test Cases passed  ---------------------- %d\n", Passcount ));
    TEST_INFO(( "Test Cases failed  ---------------------- %d\n", Failcount ));

    vTaskSuspend(NULL);
}

/* [] END OF FILE */